//Дан прямоугольник, ширина которого в два раза меньше длины.
//Найти площадь прямоугольника.

package by.htp.les02.start;

public class Main7 {

	public static void main(String[] args) {
		double a;
		double b;
		double s;
		b = 9;
		a = b / 2;
		s = a * b;
		System.out.println("Площадь прямоугольника равна " + s);

	}

}
